{"id":1860,"date":"2023-09-15T10:50:48","date_gmt":"2023-09-15T10:50:48","guid":{"rendered":"https:\/\/bluffpersonnel.com\/?post_type=awsm_job_openings&#038;p=1860"},"modified":"2023-09-15T10:50:50","modified_gmt":"2023-09-15T10:50:50","slug":"regional-qhse-manager","status":"publish","type":"awsm_job_openings","link":"https:\/\/bluffpersonnel.com\/jobs\/regional-qhse-manager\/","title":{"rendered":"Regional QHSE Manager"},"content":{"rendered":"<p>Ref: CXP030\/2023<\/p><p>To serve as the&nbsp; Divisions Health, Safety, Environmental &amp; QHSE custodian within Sub-Saharan Africa. Ensure that work practices are constructed and conducted safely and ensure all hazards are identified and controlled. Implement, maintain and enforce the Company’s operating plans for QHSE Management, Safety and Health, Environmental Compliance, Legal and Ethical compliance, Training and Maintenance of Compliance Codes<\/p><p><strong>Location: Glenwood, Durban; Occasional travel to Namibia &amp; Angola<br \/>Salary: R39 000 – R45 000<\/strong><\/p><p><strong>Main Duties include:<\/strong><\/p><p>•Responsible for management of and liaison with QHSE auditors to acquire\/maintain Company’s accreditations and report on Company’s QHSE performance to the leadership team and statutory authorities as\/when required.<\/p><p>•Conduct audits to evaluate the effectiveness of systems and procedures, identifying and assisting implementing improvements. Assist the leadership team to develop, manage and monitor the QHSE performance of the company.<\/p><p>•Maintain awareness of evolving industry QHSE regulations and best practice and how they could be applied to the Company’s operations.<\/p><p>•Monitor and advise on all QHSE matters, issues and concerns to ensure Company compliance with statutory requirements, contractual requirements and good industry practice.<\/p><p>•Liaise with Customers and Supply Chain, regarding QHSE matters, ensuring their expectations are met.<\/p><p>•Effectively communicate any relevant instructions\/requests from senior management to staff.<\/p><p>•Conduct audits to evaluate the effectiveness of systems and procedures, identifying and assisting implementing improvements. Report any infringements\/non-compliance with respect to work allocated, or any other misdemeanour to the General Manager and Management.<\/p><p>•Liaise closely with Laboratory Management to ensure customer test specifications are implemented.<\/p><p><strong>Criteria:<\/strong><\/p><p>•Grade 12 plus Diploma in QA supported with at least 5-10 years’ experience<\/p><p>•Analytical Chemistry Diploma\/Degree<\/p><p>•Up to date ISO-Certification knowledge<\/p><p>•Code B Drivers License.<\/p><p>•Experience&nbsp; in Oil &amp; Gas industry as QHSE professional with excellent and topical knowledge of Quality Management Systems.<\/p><p>•Excellent Communication and Leadership skills<\/p><p>•Computer Literate<\/p>","protected":false},"excerpt":{"rendered":"<p>Ref: CXP030\/2023 To serve as the&nbsp; Divisions Health, Safety, Environmental &amp; QHSE custodian within Sub-Saharan Africa. Ensure that work practices [&hellip;]<\/p>\n","protected":false},"author":1,"template":"","meta":[],"class_list":["post-1860","awsm_job_openings","type-awsm_job_openings","status-publish","hentry","job-category-manager","job-type-full-time","job-location-glenwood"],"_links":{"self":[{"href":"https:\/\/bluffpersonnel.com\/wp-json\/wp\/v2\/awsm_job_openings\/1860","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/bluffpersonnel.com\/wp-json\/wp\/v2\/awsm_job_openings"}],"about":[{"href":"https:\/\/bluffpersonnel.com\/wp-json\/wp\/v2\/types\/awsm_job_openings"}],"author":[{"embeddable":true,"href":"https:\/\/bluffpersonnel.com\/wp-json\/wp\/v2\/users\/1"}],"wp:attachment":[{"href":"https:\/\/bluffpersonnel.com\/wp-json\/wp\/v2\/media?parent=1860"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}